RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2022, 2024-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_pwm.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.pwm"
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Get the instance from the base address
 *
 * @param base PWM peripheral base address
 *
 * @return The PWM module instance
 */

#if defined(PWM_RESETS_ARRAY) || \
    !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
static uint32_t PWM_GetInstance(PWM_Type *base);
#endif

#if defined(PWM_RSTS)
#define PWM_RESETS_ARRAY PWM_RSTS
#elif defined(FLEXPWM_RSTS)
#define PWM_RESETS_ARRAY FLEXPWM_RSTS
#elif defined(FLEXPWM_RSTS_N)
#define PWM_RESETS_ARRAY FLEXPWM_RSTS_N
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Pointers to PWM bases for each instance. */
static PWM_Type *const s_pwmBases[] = PWM_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Pointers to PWM clocks for each PWM submodule. */
static const clock_ip_name_t s_pwmClocks[][FSL_FEATURE_PWM_SUBMODULE_COUNT] = PWM_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(PWM_RESETS_ARRAY)
/* Reset array */
static const reset_ip_name_t s_pwmResets[] = PWM_RESETS_ARRAY;
#endif

/*! @brief Temporary PWM duty cycle. */
static uint8_t s_pwmGetPwmDutyCycle[FSL_FEATURE_PWM_SUBMODULE_COUNT][PWM_SUBMODULE_CHANNEL] = {{0}};

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief Complement the variable of type uint16_t as needed
 *
 * This function can complement the variable of type uint16_t as needed.For example,
 * need to ask for the opposite of a positive integer.
 *
 * param value    Parameters of type uint16_t
 */
static inline uint16_t PWM_GetComplementU16(uint16_t value)
{
    return (MCUX_MASK_INVERT_16(value) + 1U) & 0xFFFFU;
}

static inline uint16_t dutyCycleToReloadValue(uint8_t dutyCyclePercent)
{
    uint32_t dutyCycleCount;

    /* Rounding calculations to improve the accuracy of reloadValue */
    dutyCycleCount = ((65535UL * dutyCyclePercent) + 50UL) / 100UL;
    assert(dutyCycleCount <= 0xFFFFU);

    return (uint16_t)dutyCycleCount;
}

static uint32_t PWM_GetInstance(PWM_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_pwmBases); instance++)
    {
        if (MSDK_REG_SECURE_ADDR(s_pwmBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_pwmBases));

    return instance;
}

/*!
 * brief Set register about period on one PWM submodule.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param mode        PWM operation mode, options available in enumeration ::pwm_mode_t
 * param pulseCnt    PWM period, value should be between 0 to 65535
 */
static void PWM_SetPeriodRegister(PWM_Type *base, pwm_submodule_t subModule, pwm_mode_t mode, uint16_t pulseCnt)
{
    uint16_t modulo = 0;

    switch (mode)
    {
        case kPWM_SignedCenterAligned:
            /* Setup the PWM period for a signed center aligned signal */
            modulo = (pulseCnt >> 1U);
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = PWM_GetComplementU16(modulo);
            /* Indicates the center value */
            base->SM[subModule].VAL0 = 0;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            assert(modulo > 0U);
            base->SM[subModule].VAL1 = modulo - 1U;
            break;
        case kPWM_CenterAligned:
            /* Setup the PWM period for an unsigned center aligned signal */
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = 0;
            /* Indicates the center value */
            base->SM[subModule].VAL0 = pulseCnt / 2U;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            assert(pulseCnt > 0U);
            base->SM[subModule].VAL1 = pulseCnt - 1U;
            break;
        case kPWM_SignedEdgeAligned:
            /* Setup the PWM period for a signed edge aligned signal */
            modulo = (pulseCnt >> 1U);
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = PWM_GetComplementU16(modulo);
            /* Indicates the center value */
            base->SM[subModule].VAL0 = 0;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            assert(modulo > 0U);
            base->SM[subModule].VAL1 = modulo - 1U;
            break;
        case kPWM_EdgeAligned:
            /* Setup the PWM period for a unsigned edge aligned signal */
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = 0;
            /* Indicates the center value */
            base->SM[subModule].VAL0 = pulseCnt / 2U;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            assert(pulseCnt > 0U);
            base->SM[subModule].VAL1 = (pulseCnt - 1U);
            break;
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Set register about dutycycle on one PWM submodule.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmSignal   Signal (PWM A, PWM B, PWM X) to update
 * param mode        PWM operation mode, options available in enumeration ::pwm_mode_t
 * param pulseCnt    PWM period, value should be between 0 to 65535
 * param pwmHighPulse   New PWM pulse width, value should be between 0 to 65535
 */
static void PWM_SetDutycycleRegister(PWM_Type *base,
                                     pwm_submodule_t subModule,
                                     pwm_channels_t pwmSignal,
                                     pwm_mode_t mode,
                                     uint16_t pulseCnt,
                                     uint16_t pwmHighPulse)
{
    uint16_t modulo = 0;

    switch (mode)
    {
        case kPWM_SignedCenterAligned:
            /* Setup the PWM dutycycle for a signed center aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = PWM_GetComplementU16(pwmHighPulse / 2U);
                base->SM[subModule].VAL3 = pwmHighPulse / 2U;
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = PWM_GetComplementU16(pwmHighPulse / 2U);
                base->SM[subModule].VAL5 = pwmHighPulse / 2U;
            }
            else
            {
                ; /* Intentional empty */
            }
            break;
        case kPWM_CenterAligned:
            assert(pulseCnt >= pwmHighPulse);
            /* Setup the PWM dutycycle for an unsigned center aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = (pulseCnt - pwmHighPulse) / 2U;
                base->SM[subModule].VAL3 = (uint16_t)((((uint32_t)pulseCnt + (uint32_t)pwmHighPulse) / 2U) & 0xFFFFU);
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = (pulseCnt - pwmHighPulse) / 2U;
                base->SM[subModule].VAL5 = (uint16_t)((((uint32_t)pulseCnt + (uint32_t)pwmHighPulse) / 2U) & 0xFFFFU);
            }
            else
            {
                ; /* Intentional empty */
            }
            break;
        case kPWM_SignedEdgeAligned:
            modulo = (pulseCnt >> 1U);
            /* Setup the PWM dutycycle for a signed edge aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = PWM_GetComplementU16(modulo);
                base->SM[subModule].VAL3 = (uint16_t)((PWM_GetComplementU16(modulo) + pwmHighPulse) & 0xFFFFU);
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = PWM_GetComplementU16(modulo);
                base->SM[subModule].VAL5 = (uint16_t)((PWM_GetComplementU16(modulo) + pwmHighPulse) & 0xFFFFU);
            }
            else
            {
                base->SM[subModule].VAL0 = (uint16_t)((PWM_GetComplementU16(modulo) + pwmHighPulse) & 0xFFFFU);
            }
            break;
        case kPWM_EdgeAligned:
            /* Setup the PWM dutycycle for a unsigned edge aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = 0;
                base->SM[subModule].VAL3 = pwmHighPulse;
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = 0;
                base->SM[subModule].VAL5 = pwmHighPulse;
            }
            else
            {
                base->SM[subModule].VAL0 = pwmHighPulse;
            }
            break;
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Ungates the PWM submodule clock and configures the peripheral for basic operation.
 *
 * This API should be called at the beginning of the application using the PWM driver.
 * When user select PWMX, user must choose edge aligned output, becasue there are some limitation on center
 * aligned PWMX output.
 * When output PWMX in center aligned mode, VAL1 register controls both PWM period and PWMX duty cycle, PWMA
 * and PWMB output will be corrupted. But edge aligned PWMX output do not have such limit.
 * In master reload counter initialization mode, PWM period is depended by period of set LDOK in submodule 0
 * because this operation will reload register.
 * Submodule 0 counter initialization cannot be master sync or master reload.
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param config    Pointer to user's PWM config structure.
 *
 * return kStatus_Success means success; else failed.
 */
status_t PWM_Init(PWM_Type *base, pwm_submodule_t subModule, const pwm_config_t *config)
{
    assert(config != NULL);

    uint16_t reg;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    /* Source clock for submodule 0 cannot be itself */
    if ((config->clockSource == kPWM_Submodule0Clock) && (subModule == kPWM_Module_0))
    {
        return kStatus_Fail;
    }

    /* Reload source select clock for submodule 0 cannot be master reload */
    if ((config->reloadSelect == kPWM_MasterReload) && (subModule == kPWM_Module_0))
    {
        return kStatus_Fail;
    }

    /* Counter initialize for submodule 0 cannot be master reload or master sync. */
    if ((config->initializationControl == kPWM_Initialize_MasterReload ||
         config->initializationControl == kPWM_Initialize_MasterSync) &&
        (subModule == kPWM_Module_0))
    {
        return kStatus_Fail;
    }

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Ungate the PWM submodule clock*/
    (void)CLOCK_EnableClock(s_pwmClocks[PWM_GetInstance(base)][subModule]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(PWM_RESETS_ARRAY)
    RESET_ReleasePeripheralReset(s_pwmResets[PWM_GetInstance(base)]);
#endif

    /* Clear the fault status flags */
#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    for (uint16_t i = 0; i < FSL_FEATURE_PWM_FAULT_CH_COUNT; i++)
    {
        base->FAULT[i].FSTS |= PWM_FSTS_FFLAG_MASK;
    }
#else
    base->FSTS |= PWM_FSTS_FFLAG_MASK;
#endif

    reg = base->SM[subModule].CTRL2;

