RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
        /* Setup register shift values based on the channel being configured.
         * Also setup the deadtime value
         */
        if (chnlParams->pwmChannel == kPWM_PwmA)
        {
            polarityShift              = PWM_OCTRL_POLA_SHIFT;
            outputEnableShift          = PWM_OUTEN_PWMA_EN_SHIFT;
            base->SM[subModule].DTCNT0 = PWM_DTCNT0_DTCNT0(chnlParams->deadtimeValue);
        }
        else if (chnlParams->pwmChannel == kPWM_PwmB)
        {
            polarityShift              = PWM_OCTRL_POLB_SHIFT;
            outputEnableShift          = PWM_OUTEN_PWMB_EN_SHIFT;
            base->SM[subModule].DTCNT1 = PWM_DTCNT1_DTCNT1(chnlParams->deadtimeValue);
        }
        else
        {
            polarityShift     = PWM_OCTRL_POLX_SHIFT;
            outputEnableShift = PWM_OUTEN_PWMX_EN_SHIFT;
        }

        /* Set PWM output fault status */
        switch (chnlParams->pwmChannel)
        {
            case kPWM_PwmA:
                base->SM[subModule].OCTRL &= MCUX_MASK_INVERT_16(PWM_OCTRL_PWMAFS_MASK);
                base->SM[subModule].OCTRL |= (((uint16_t)(chnlParams->faultState) << (uint16_t)PWM_OCTRL_PWMAFS_SHIFT) &
                                              (uint16_t)PWM_OCTRL_PWMAFS_MASK);
                break;
            case kPWM_PwmB:
                base->SM[subModule].OCTRL &= MCUX_MASK_INVERT_16(PWM_OCTRL_PWMBFS_MASK);
                base->SM[subModule].OCTRL |= (((uint16_t)(chnlParams->faultState) << (uint16_t)PWM_OCTRL_PWMBFS_SHIFT) &
                                              (uint16_t)PWM_OCTRL_PWMBFS_MASK);
                break;
            case kPWM_PwmX:
                base->SM[subModule].OCTRL &= MCUX_MASK_INVERT_16(PWM_OCTRL_PWMXFS_MASK);
                base->SM[subModule].OCTRL |= (((uint16_t)(chnlParams->faultState) << (uint16_t)PWM_OCTRL_PWMXFS_SHIFT) &
                                              (uint16_t)PWM_OCTRL_PWMXFS_MASK);
                break;
            default:
                assert(false);
                break;
        }

        /* Setup signal active level */
        if ((bool)chnlParams->level == kPWM_HighTrue)
        {
            base->SM[subModule].OCTRL &= MCUX_MASK_INVERT_16((uint16_t)1U << polarityShift);
        }
        else
        {
            base->SM[subModule].OCTRL |= ((uint16_t)1U << polarityShift);
        }

        if (chnlParams->pwmchannelenable)
        {
            /* Enable PWM output */
            base->OUTEN |= ((uint16_t)subModuleMsk << outputEnableShift);
        }

        /* Get the pwm duty cycle */
        s_pwmGetPwmDutyCycle[subModule][chnlParams->pwmChannel] = chnlParams->dutyCyclePercent;

        /* Get the next channel parameters */
        chnlParams++;
    }

    return kStatus_Success;
}

/*!
 * brief Set PWM phase shift for PWM channel running on channel PWM_A, PWM_B which with 50% duty cycle.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmChannel  PWM channel to configure
 * param pwmFreq_Hz  PWM signal frequency in Hz
 * param srcClock_Hz PWM main counter clock in Hz.
 * param shiftvalue  Phase shift value, range in 0 ~ 50
 * param doSync      true: Set LDOK bit for the submodule list;
 *                   false: LDOK bit don't set, need to call PWM_SetPwmLdok to sync update.
 *
 * return Returns kStatus_Fail if there was error setting up the signal; kStatus_Success otherwise
 */
status_t PWM_SetupPwmPhaseShift(PWM_Type *base,
                                pwm_submodule_t subModule,
                                pwm_channels_t pwmChannel,
                                uint32_t pwmFreq_Hz,
                                uint32_t srcClock_Hz,
                                uint8_t shiftvalue,
                                bool doSync)
{
    assert(pwmFreq_Hz != 0U);
    assert(srcClock_Hz != 0U);
    assert(shiftvalue <= 50U);

    uint32_t pwmClock;
    uint16_t pulseCnt = 0, pwmHighPulse = 0;
    uint16_t modulo = 0, complement = 0;
    uint16_t shift  = 0;
    uint32_t ticksTemp;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    if (pwmChannel != kPWM_PwmX)
    {
        /* Divide the clock by the prescale value */
        pwmClock = (srcClock_Hz / (1UL << ((base->SM[subModule].CTRL & PWM_CTRL_PRSC_MASK) >> PWM_CTRL_PRSC_SHIFT)));

        ticksTemp = pwmClock / pwmFreq_Hz;
        assert(ticksTemp <= 0xFFFFU);
        pulseCnt = (uint16_t)ticksTemp;

        /* Clear LDOK bit if it is set */
        if (0U != (base->MCTRL & PWM_MCTRL_LDOK(subModuleMsk)))
        {
            base->MCTRL |= PWM_MCTRL_CLDOK(subModuleMsk);
        }

        modulo = (pulseCnt >> 1U);
        complement = PWM_GetComplementU16(modulo);

        /* Indicates the start of the PWM period */
        base->SM[subModule].INIT = complement;
        /* Indicates the center value */
        base->SM[subModule].VAL0 = 0;
        /* Indicates the end of the PWM period */
        /* The change during the end to start of the PWM period requires a count time */
        assert(modulo > 0U);
        base->SM[subModule].VAL1 = modulo - 1U;

        /* Immediately upon when MCTRL[LDOK] being set */
        base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;

        /* phase shift value */
        ticksTemp = ((uint32_t)pulseCnt * (uint32_t)shiftvalue) / 100UL;
        assert(ticksTemp <= 0xFFFFU);
        shift = (uint16_t)ticksTemp;

        /* duty cycle 50% */
        pwmHighPulse = pulseCnt / 2U;

        assert(complement <= 0xFFFFU - shift);
        ticksTemp = (uint32_t)complement + (uint32_t)shift;

        assert(ticksTemp <= 0x10000U - pwmHighPulse);

        if (pwmChannel == kPWM_PwmA)
        {
            base->SM[subModule].VAL2 = (uint16_t)ticksTemp;
            base->SM[subModule].VAL3 = (uint16_t)((ticksTemp + pwmHighPulse - 1U) & 0xFFFFU);
        }
        else if (pwmChannel == kPWM_PwmB)
        {
            base->SM[subModule].VAL4 = (uint16_t)ticksTemp;
            base->SM[subModule].VAL5 = (uint16_t)((ticksTemp + pwmHighPulse - 1U) & 0xFFFFU);
        }
        else
        {
            return kStatus_Fail;
        }

