RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
        if (doSync)
        {
            /* Set LDOK bit to load VALx bit */
            base->MCTRL |= PWM_MCTRL_LDOK(subModuleMsk);
        }
    }
    else
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}

/*!
 * brief Updates the PWM signal's dutycycle.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * param base              PWM peripheral base address
 * param subModule         PWM submodule to configure
 * param pwmSignal         Signal (PWM A, PWM B, PWM X) to update
 * param currPwmMode       The current PWM mode set during PWM setup
 * param dutyCyclePercent  New PWM pulse width, value should be between 0 to 100
 *                          0=inactive signal(0% duty cycle)...
 *                          100=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycle(PWM_Type *base,
                            pwm_submodule_t subModule,
                            pwm_channels_t pwmSignal,
                            pwm_mode_t currPwmMode,
                            uint8_t dutyCyclePercent)
{
    assert(dutyCyclePercent <= 100U);
    uint16_t reloadValue = dutyCycleToReloadValue(dutyCyclePercent);

    PWM_UpdatePwmDutycycleHighAccuracy(base, subModule, pwmSignal, currPwmMode, reloadValue);
}

/*!
 * brief Updates the PWM signal's dutycycle with 16-bit accuracy.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * param base              PWM peripheral base address
 * param subModule         PWM submodule to configure
 * param pwmSignal         Signal (PWM A, PWM B, PWM X) to update
 * param currPwmMode       The current PWM mode set during PWM setup
 * param dutyCycle         New PWM pulse width, value should be between 0 to 65535
 *                          0=inactive signal(0% duty cycle)...
 *                          65535=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycleHighAccuracy(
    PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmSignal, pwm_mode_t currPwmMode, uint16_t dutyCycle)
{
    uint16_t pulseCnt, pulseEndCnt;
    uint32_t pwmHighPulse;
    uint8_t subModuleSync;

    /* If submodule initialization control is Master Sync, PWM period is submodule 0 PWM period. */
    if (((base->SM[subModule].CTRL2 & PWM_CTRL2_INIT_SEL_MASK) >> PWM_CTRL2_INIT_SEL_SHIFT) ==
        (uint16_t)kPWM_Initialize_MasterSync)
    {
        subModuleSync = (uint8_t)kPWM_Module_0;
    }
    else
    {
        subModuleSync = (uint8_t)subModule;
    }

    /* Get pwm period and pulse width. */
    pulseEndCnt = base->SM[subModuleSync].VAL1;
    /* Calculate PWM period from counter range.
     * Note: pulseEndCnt may be numerically lower than INIT in signed PWM modes
     * (e.g., kPWM_SignedCenterAligned, kPWM_SignedEdgeAligned) where INIT holds
     * a negative value in two's complement form. The subtraction correctly wraps
     * around in uint16_t arithmetic to produce the proper period count.
     * Example: INIT=0xFFF0 (-16), VAL1=0x000F (15) -> period = 15 - (-16) + 1 = 32
     */
    pulseCnt = pulseEndCnt - base->SM[subModuleSync].INIT + 1U;

    pwmHighPulse = ((uint32_t)pulseCnt * (uint32_t)dutyCycle) / 65535UL;
    assert(pwmHighPulse <= 0xFFFFU);

    /* Update register about dutycycle */
    PWM_SetDutycycleRegister(base, subModule, pwmSignal, currPwmMode, pulseCnt, (uint16_t)pwmHighPulse);

    /* Get the pwm duty cycle */
    s_pwmGetPwmDutyCycle[subModule][pwmSignal] = (uint8_t)(dutyCycle * 100U / 65535U);
}

/*!
 * brief Update the PWM signal's period and dutycycle for a PWM submodule.
 *
 * The function updates PWM signal period generated by a specific submodule according to the parameters
 * passed in by the user. This function can also set dutycycle weather you want to keep original dutycycle
 * or update new dutycycle. Call this function in local sync control mode because PWM period is depended by
 * INIT and VAL1 register of each submodule. In master sync initialization control mode, call this function
 * to update INIT and VAL1 register of all submodule because PWM period is depended by INIT and VAL1 register
 * in submodule0. If the dead time insertion logic is enabled, the pulse period is reduced by the dead time
 * period specified by the user. PWM signal will not be generated if its period is less than dead time duration.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmSignal   Signal (PWM A or PWM B) to update
 * param currPwmMode The current PWM mode set during PWM setup, options available in enumeration ::pwm_mode_t
 * param pulseCnt    New PWM period, value should be between 0 to 65535
 *                    0=minimum PWM period...
 *                    65535=maximum PWM period
 * param dutyCycle   New PWM pulse width of channel, value should be between 0 to 65535
 *                    0=inactive signal(0% duty cycle)...
 *                    65535=active signal (100% duty cycle)
 *                    You can keep original dutycycle or update new dutycycle
 */
void PWM_UpdatePwmPeriodAndDutycycle(PWM_Type *base,
                                     pwm_submodule_t subModule,
                                     pwm_channels_t pwmSignal,
                                     pwm_mode_t currPwmMode,
                                     uint16_t pulseCnt,
                                     uint16_t dutyCycle)
{
    uint16_t pwmHighPulse = 0;
    uint32_t ticksTemp;

    assert(pwmSignal != kPWM_PwmX);

    /* Calculate pulse width */
    ticksTemp = ((uint32_t)pulseCnt * (uint32_t)dutyCycle) / 65535UL;
    assert(ticksTemp <= 0xFFFFU);
    pwmHighPulse = (uint16_t)ticksTemp;

    /* Update register about period */
    PWM_SetPeriodRegister(base, subModule, currPwmMode, pulseCnt);

    /* Update register about dutycycle */
    PWM_SetDutycycleRegister(base, subModule, pwmSignal, currPwmMode, pulseCnt, pwmHighPulse);

