RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
    /* Get the pwm duty cycle */
    s_pwmGetPwmDutyCycle[subModule][pwmSignal] = (uint8_t)((dutyCycle * 100U) / 65535U);
}

/*!
 * brief Sets up the PWM input capture
 *
 * Each PWM submodule has 3 pins that can be configured for use as input capture pins. This function
 * sets up the capture parameters for each pin and enables the pin for input capture operation.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param pwmChannel         Channel in the submodule to setup
 * param inputCaptureParams Parameters passed in to set up the input pin
 */
void PWM_SetupInputCapture(PWM_Type *base,
                           pwm_submodule_t subModule,
                           pwm_channels_t pwmChannel,
                           const pwm_input_capture_param_t *inputCaptureParams)
{
    uint16_t reg = 0;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    switch (pwmChannel)
    {
#if defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA
        case kPWM_PwmA:
            /* Setup the capture paramters for PWM A pin */
            reg = (PWM_CAPTCTRLA_EDGA0(inputCaptureParams->edge0) |
                   PWM_CAPTCTRLA_EDGA1(inputCaptureParams->edge1) |
                   PWM_CAPTCTRLA_CFAWM(inputCaptureParams->fifoWatermark));

            reg |= (inputCaptureParams->captureInputSel ? PWM_CAPTCTRLA_INP_SELA_MASK : 0U);
            reg |= (inputCaptureParams->enableOneShotCapture ? PWM_CAPTCTRLA_ONESHOTA_MASK : 0U);

            /* Enable the edge counter if using the output edge counter */
            if (inputCaptureParams->captureInputSel)
            {
                reg |= PWM_CAPTCTRLA_EDGCNTA_EN_MASK;
            }
            /* Enable input capture operation */
            reg |= PWM_CAPTCTRLA_ARMA_MASK;

            base->SM[subModule].CAPTCTRLA = reg;

            /* Setup the compare value when using the edge counter as source */
            base->SM[subModule].CAPTCOMPA = PWM_CAPTCOMPA_EDGCMPA(inputCaptureParams->edgeCompareValue);

            /* Setup PWM A pin for input capture */
            base->OUTEN &= MCUX_MASK_INVERT_16((uint16_t)subModuleMsk << PWM_OUTEN_PWMA_EN_SHIFT);
            break;
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA */
#if defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB
        case kPWM_PwmB:
            /* Setup the capture paramters for PWM B pin */
            reg = (PWM_CAPTCTRLB_EDGB0(inputCaptureParams->edge0) |
                   PWM_CAPTCTRLB_EDGB1(inputCaptureParams->edge1) |
                   PWM_CAPTCTRLB_CFBWM(inputCaptureParams->fifoWatermark));

            reg |= (inputCaptureParams->captureInputSel ? PWM_CAPTCTRLB_INP_SELB_MASK : 0U);
            reg |= (inputCaptureParams->enableOneShotCapture ? PWM_CAPTCTRLB_ONESHOTB_MASK : 0U);

            /* Enable the edge counter if using the output edge counter */
            if (inputCaptureParams->captureInputSel)
            {
                reg |= PWM_CAPTCTRLB_EDGCNTB_EN_MASK;
            }
            /* Enable input capture operation */
            reg |= PWM_CAPTCTRLB_ARMB_MASK;

            base->SM[subModule].CAPTCTRLB = reg;

            /* Setup the compare value when using the edge counter as source */
            base->SM[subModule].CAPTCOMPB = PWM_CAPTCOMPB_EDGCMPB(inputCaptureParams->edgeCompareValue);

            /* Setup PWM B pin for input capture */
            base->OUTEN &= MCUX_MASK_INVERT_16((uint16_t)subModuleMsk << PWM_OUTEN_PWMB_EN_SHIFT);
            break;
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB */
#if defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELX) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELX
        case kPWM_PwmX:
            reg = (PWM_CAPTCTRLX_EDGX0(inputCaptureParams->edge0) |
                   PWM_CAPTCTRLX_EDGX1(inputCaptureParams->edge1) |
                   PWM_CAPTCTRLX_CFXWM(inputCaptureParams->fifoWatermark));

            reg |= (inputCaptureParams->captureInputSel ? PWM_CAPTCTRLX_INP_SELX_MASK : 0U);
            reg |= (inputCaptureParams->enableOneShotCapture ? PWM_CAPTCTRLX_ONESHOTX_MASK : 0U);

            /* Enable the edge counter if using the output edge counter */
            if (inputCaptureParams->captureInputSel)
            {
                reg |= PWM_CAPTCTRLX_EDGCNTX_EN_MASK;
            }
            /* Enable input capture operation */
            reg |= PWM_CAPTCTRLX_ARMX_MASK;

            base->SM[subModule].CAPTCTRLX = reg;

            /* Setup the compare value when using the edge counter as source */
            base->SM[subModule].CAPTCOMPX = PWM_CAPTCOMPX_EDGCMPX(inputCaptureParams->edgeCompareValue);

            /* Setup PWM X pin for input capture */
            base->OUTEN &= MCUX_MASK_INVERT_16((uint16_t)subModuleMsk << PWM_OUTEN_PWMX_EN_SHIFT);
            break;
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELX */
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Read the capture value.
 *
 * This function reads the capture value stored in channel's capture value register.
 * It should be called when a valid edge is detected on the input capture pin(related capture flag is set).
 * The capture circuit has two input capture registers per channel for first edge and second edge capture.
 *
 * param base         PWM peripheral base address
 * param subModule    PWM submodule to configure
 * param pwmChannel   PWM channel to read from (PWM A, PWM B, or PWM X)
 * param captureIndex Capture register to read (0 for first edge capture, 1 for second edge capture)
 *
 * return Returns kStatus_InvalidArgument if pwmChannel does not support capture feature;
 *        kStatus_Success otherwise
 */
status_t PWM_GetInputCaptureValue(PWM_Type *base,
                                  pwm_submodule_t subModule,
                                  pwm_channels_t pwmChannel,
                                  uint8_t captureIndex,
                                  uint16_t *captureValue)
{
    assert(captureIndex <= 1U);
    assert((uint32_t)subModule < (uint32_t)FSL_FEATURE_PWM_SUBMODULE_COUNT);

