RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
    status_t status = kStatus_Success;

    switch (pwmChannel)
    {
#if defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA
        case kPWM_PwmA:
            /* Channel A always uses CVAL0 and CVAL1 */
            if (captureIndex == 0U)
            {
                *captureValue = base->SM[subModule].CVAL0;
            }
            else
            {
                *captureValue = base->SM[subModule].CVAL1;
            }
            break;
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA */

#if defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB
        case kPWM_PwmB:
            /* Channel B always uses CVAL2 and CVAL3 */
            if (captureIndex == 0U)
            {
                *captureValue = base->SM[subModule].CVAL2;
            }
            else
            {
                *captureValue = base->SM[subModule].CVAL3;
            }
            break;
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB */

#if defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELX) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELX
        case kPWM_PwmX:
            /* Channel X register mapping depends on device:
             * - If Channel A/B capture exists: X uses CVAL4/5 (MIMXRT1189, etc.)
             * - If only X capture exists: X uses CVAL0/1 (MCXA153, etc.)
             */
#if (defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA) && \
    (defined(FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB) && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB)
            /* Multi-channel capture device: X uses CVAL4/5 */
            if (captureIndex == 0U)
            {
                *captureValue = base->SM[subModule].CVAL4;
            }
            else
            {
                *captureValue = base->SM[subModule].CVAL5;
            }
#else
            /* X-only capture device: X uses CVAL0/1 */
            if (captureIndex == 0U)
            {
                *captureValue = base->SM[subModule].CVAL0;
            }
            else
            {
                *captureValue = base->SM[subModule].CVAL1;
            }
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELA && FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELB*/
            break;
#endif /* FSL_FEATURE_PWM_HAS_CAPTURE_ON_CHANNELX */

        default:
            status = kStatus_InvalidArgument;
            break;
    }

    return status;
}

/*!
 * @brief Sets up the PWM fault channel 0 input filter.
 *
 * @param base                   PWM peripheral base address
 * @param faultInputFilterParams Parameters passed in to set up the fault input filter.
 */
void PWM_SetupFaultInputFilter(PWM_Type *base, const pwm_fault_input_filter_param_t *faultInputFilterParams)
{
    PWM_SetupFaultInputFilterExt(base, kPWM_faultchannel_0, faultInputFilterParams);
}

/*!
 * @brief Sets up the PWM fault input filter.
 *
 * @param base                   PWM peripheral base address
 * @param faultChannel           PWM fault channel to configure.
 * @param faultInputFilterParams Parameters passed in to set up the fault input filter.
 */
void PWM_SetupFaultInputFilterExt(PWM_Type *base,
                                  pwm_fault_channels_t faultChannel,
                                  const pwm_fault_input_filter_param_t *faultInputFilterParams)
{
    assert(NULL != faultInputFilterParams);

#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    volatile uint16_t *ptrFFILT = &base->FAULT[faultChannel].FFILT;
#else
    (void)faultChannel;
    volatile uint16_t *ptrFFILT = &base->FFILT;
#endif

    /* When changing values for fault period from a non-zero value, first write a value of 0 to clear the filter. */
    if (0U != (*ptrFFILT & PWM_FFILT_FILT_PER_MASK))
    {
        *ptrFFILT &= MCUX_MASK_INVERT_16(PWM_FFILT_FILT_PER_MASK);
    }

    *ptrFFILT = PWM_FFILT_FILT_PER(faultInputFilterParams->faultFilterPeriod) |
                PWM_FFILT_FILT_CNT(faultInputFilterParams->faultFilterCount) |
                PWM_FFILT_GSTR(faultInputFilterParams->faultGlitchStretch ? 1U : 0U);
}

/*!
 * brief Sets up the PWM fault channel 0 protection.
 *
 * param base        PWM peripheral base address
 * param faultNum    PWM fault to configure.
 * param faultParams Pointer to the PWM fault config structure
 */
void PWM_SetupFaults(PWM_Type *base, pwm_fault_input_t faultNum, const pwm_fault_param_t *faultParams)
{
    PWM_SetupFaultsExt(base, kPWM_faultchannel_0, faultNum, faultParams);
}

/*!
 * brief Sets up the PWM fault protection.
 *
 * param base         PWM peripheral base address
 * param faultChannel PWM fault channel to configure.
 * param faultNum     PWM fault to configure.
 * param faultParams  Pointer to the PWM fault config structure
 */
void PWM_SetupFaultsExt(PWM_Type *base,
                        pwm_fault_channels_t faultChannel,
                        pwm_fault_input_t faultNum,
                        const pwm_fault_param_t *faultParams)
{
    assert(faultParams != NULL);

    uint16_t reg;
    uint32_t faultMsk = 1UL << (uint32_t)faultNum;
    assert(faultMsk <= 0x8U);

#if defined(FSL_FEATURE_PWM_FAULT_CH_COUNT) && (FSL_FEATURE_PWM_FAULT_CH_COUNT > 1)
    volatile uint16_t *ptrFCTRL = &base->FAULT[faultChannel].FCTRL;
    volatile uint16_t *ptrFCTRL2 = &base->FAULT[faultChannel].FCTRL2;
    volatile uint16_t *ptrFSTS = &base->FAULT[faultChannel].FSTS;
#else
    (void)faultChannel;
    volatile uint16_t *ptrFCTRL = &base->FCTRL;
    volatile uint16_t *ptrFCTRL2 = &base->FCTRL2;
    volatile uint16_t *ptrFSTS = &base->FSTS;
#endif

    reg = *ptrFCTRL;
    /* Set the faults level-settting */
    if (faultParams->faultLevel)
    {
        reg |= ((uint16_t)faultMsk << PWM_FCTRL_FLVL_SHIFT);
    }
    else
    {
        reg &= MCUX_MASK_INVERT_16((uint16_t)faultMsk << PWM_FCTRL_FLVL_SHIFT);
    }
    /* Set the fault clearing mode */
    if ((uint16_t)faultParams->faultClearingMode != 0U)
    {
        /* Use manual fault clearing */
        reg &= MCUX_MASK_INVERT_16((uint16_t)faultMsk << PWM_FCTRL_FAUTO_SHIFT);
        if (faultParams->faultClearingMode == kPWM_ManualSafety)
        {
            /* Use manual fault clearing with safety mode enabled */
            reg |= ((uint16_t)faultMsk << PWM_FCTRL_FSAFE_SHIFT);
        }
        else
        {
            /* Use manual fault clearing with safety mode disabled */
            reg &= MCUX_MASK_INVERT_16((uint16_t)faultMsk << PWM_FCTRL_FSAFE_SHIFT);
        }
    }
    else
    {
        /* Use automatic fault clearing */
        reg |= ((uint16_t)faultMsk << PWM_FCTRL_FAUTO_SHIFT);
    }
    *ptrFCTRL = reg;

    /* Set the combinational path option */
    if (faultParams->enableCombinationalPath)
    {
        /* Combinational path from the fault input to the PWM output is available */
        *ptrFCTRL2 &= MCUX_MASK_INVERT_16((uint16_t)faultMsk << PWM_FCTRL2_NOCOMB_SHIFT);
    }
    else
    {
        /* No combinational path available, only fault filter & latch signal can disable PWM output */
        *ptrFCTRL2 |= ((uint16_t)faultMsk << PWM_FCTRL2_NOCOMB_SHIFT);
    }

    /* Initially clear both recovery modes */
    reg = *ptrFSTS;
    reg &= MCUX_MASK_INVERT_16(((uint16_t)faultMsk << PWM_FSTS_FFULL_SHIFT) |
             ((uint16_t)faultMsk << PWM_FSTS_FHALF_SHIFT));
    /* Setup fault recovery */
    switch (faultParams->recoverMode)
    {
        case kPWM_NoRecovery:
            break;
        case kPWM_RecoverHalfCycle:
            reg |= ((uint16_t)faultMsk << PWM_FSTS_FHALF_SHIFT);
            break;
        case kPWM_RecoverFullCycle:
            reg |= ((uint16_t)faultMsk << PWM_FSTS_FFULL_SHIFT);
            break;
        case kPWM_RecoverHalfAndFullCycle:
            reg |= ((uint16_t)faultMsk << PWM_FSTS_FHALF_SHIFT);
            reg |= ((uint16_t)faultMsk << PWM_FSTS_FFULL_SHIFT);
            break;
        default:
            assert(false);
            break;
    }
    *ptrFSTS = reg;
}

/*!
 * brief  Fill in the PWM fault config struct with the default settings
 *
 * The default values are:
 * code
 *   config->faultClearingMode = kPWM_Automatic;
 *   config->faultLevel = false;
 *   config->enableCombinationalPath = true;
 *   config->recoverMode = kPWM_NoRecovery;
 * endcode
 * param config Pointer to user's PWM fault config structure.
 */
void PWM_FaultDefaultConfig(pwm_fault_param_t *config)
{
    assert(config != NULL);

    /* Initializes the configure structure to zero. */
    (void)memset(config, 0, sizeof(*config));

    /* PWM uses automatic fault clear mode */
    config->faultClearingMode = kPWM_Automatic;
    /* PWM fault level is set to logic 0 */
    config->faultLevel = false;
    /* Combinational Path from fault input is enabled */
    config->enableCombinationalPath = true;
    /* PWM output will stay inactive when recovering from a fault */
    config->recoverMode = kPWM_NoRecovery;
}

/*!
 * brief Selects the signal to output on a PWM pin when a FORCE_OUT signal is asserted.
 *
 * The user specifies which channel to configure by supplying the submodule number and whether
 * to modify PWM A or PWM B within that submodule.
 *
 * param base       PWM peripheral base address
 * param subModule  PWM submodule to configure
 * param pwmChannel Channel to configure
 * param mode       Signal to output when a FORCE_OUT is triggered
 */
void PWM_SetupForceSignal(PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmChannel, pwm_force_signal_t mode)

{
    uint16_t shift;
    uint16_t reg;

    /* DTSRCSEL register has 4 bits per submodule; 2 bits for PWM A and 2 bits for PWM B */
    shift = ((uint16_t)subModule * 4U) + ((uint16_t)pwmChannel * 2U);
    /* Validate shift to prevent register overflow. Since mode occupies 2 bits, the maximum safe shift
     * is 14 bits to keep the result within 16-bit bounds.
     */
    assert((uint32_t)mode <= 3U && shift <= 14U);
    /* Setup the signal to be passed upon occurrence of a FORCE_OUT signal */
    reg = base->DTSRCSEL;
    reg &= MCUX_MASK_INVERT_16(((uint32_t)0x3U << shift) & 0xFFFFU);

    reg |= (((uint16_t)mode << shift) & 0xFFFFU);
    base->DTSRCSEL = reg;
}

/*!
 * brief Updates the current polarity (MCTRL[IPOL]) for a PWM submodule.
 *
 * MCTRL[IPOL] is a double-buffered field. This function only writes the shadow register;
 * the value does NOT take effect until a FORCE_OUT event occurs. Call PWM_EnableLocalForce()
 * after this function to apply all pending changes atomically in one FORCE_OUT event.
 *
 * Only meaningful when the submodule operates in complementary mode (CTRL2[INDEP] = 0).
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param polarity  kPWM_ComplementaryPwmA or kPWM_ComplementaryPwmB
 */
void PWM_UpdateCurrentPolarity(PWM_Type *base, pwm_submodule_t subModule, pwm_chnl_pair_operation_t polarity)
{
    uint16_t subModuleMsk = (uint16_t)(((uint32_t)1U << (uint32_t)subModule) & 0xFFFFU);

    /* Write the new IPOL value to the double-buffered MCTRL[IPOL] field.
     * This value will not take effect until a FORCE_OUT event occurs. */
    if (polarity == kPWM_ComplementaryPwmA)
    {
        /* Clear the IPOL bit for this submodule: PWM23 drives the complementary pair */
        base->MCTRL &= MCUX_MASK_INVERT_16((uint16_t)subModuleMsk << PWM_MCTRL_IPOL_SHIFT);
    }
    else
    {
        /* Set the IPOL bit for this submodule: PWM45 drives the complementary pair */
        base->MCTRL |= ((uint16_t)subModuleMsk << PWM_MCTRL_IPOL_SHIFT);
    }
}

/*!
 * brief Set PWM output in idle status (high or low).
 *
 * note This API should call after PWM_SetupPwm() APIs, and PWMX submodule is not supported.
 *
 * param base               PWM peripheral base address
 * param pwmChannel         PWM channel to configure
 * param subModule          PWM submodule to configure
 * param idleStatus         True: PWM output is high in idle status; false: PWM output is low in idle status.
 *
 * return kStatus_Fail if there was error setting up the signal; kStatus_Success if set output idle success
 */
status_t PWM_SetOutputToIdle(PWM_Type *base, pwm_channels_t pwmChannel, pwm_submodule_t subModule, bool idleStatus)
{
    uint16_t valOn = 0, valOff = 0;
    uint16_t init;
    uint32_t val1;
    uint16_t ldmod;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    /* Clear LDOK bit if it is set */
    if (0U != (base->MCTRL & PWM_MCTRL_LDOK(subModuleMsk)))
    {
        base->MCTRL |= PWM_MCTRL_CLDOK(subModuleMsk);
    }

    init = base->SM[subModule].INIT;
    val1 = base->SM[subModule].VAL1 + 1UL;

    assert(val1 <= 0xFFFFU);
    valOn  = (uint16_t)val1;
    valOff = init;

    if ((valOff + 1U) == valOn)
    {
        return kStatus_Fail;
    }

    /* Should not PWM_X channel */
    if (kPWM_PwmA == pwmChannel)
    {
        if (0U != (base->SM[subModule].OCTRL & PWM_OCTRL_POLA_MASK))
        {
            if (!idleStatus)
            {
                valOn  = init;
                valOff = (uint16_t)val1;
            }
        }
        else
        {
            if (idleStatus)
            {
                valOn  = init;
                valOff = (uint16_t)val1;
            }
        }
        base->SM[subModule].VAL2 = valOn;
        base->SM[subModule].VAL3 = valOff;
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        if (0U != (base->SM[subModule].OCTRL & PWM_OCTRL_POLB_MASK))
        {
            if (!idleStatus)
            {
                valOn  = init;
                valOff = (uint16_t)val1;
            }
        }
        else
        {
            if (idleStatus)
            {
                valOn  = init;
                valOff = (uint16_t)val1;
            }
        }
        base->SM[subModule].VAL4 = valOn;
        base->SM[subModule].VAL5 = valOff;
    }
    else
    {
        return kStatus_Fail;
    }

    /* Record Load mode */
    ldmod = base->SM[subModule].CTRL;
    /* Set Load mode to make Buffered registers take effect immediately when LDOK bit set */
    base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;
    /* Set LDOK bit to load buffer registers */
    base->MCTRL |= PWM_MCTRL_LDOK(subModuleMsk);
    /* Restore Load mode */
    base->SM[subModule].CTRL = ldmod;

