RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
    /* Get pwm duty cycle */
    s_pwmGetPwmDutyCycle[subModule][pwmChannel] = 0x0U;

    return kStatus_Success;
}

/*!
 * brief Get the dutycycle value.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmChannel  PWM channel to configure
 *
 * return Current channel dutycycle value.
 */
uint8_t PWM_GetPwmChannelState(PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmChannel)
{
    return s_pwmGetPwmDutyCycle[subModule][pwmChannel];
}

/*!
 * brief Set the pwm submodule prescaler.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param prescaler          Set prescaler value
 */
void PWM_SetClockMode(PWM_Type *base, pwm_submodule_t subModule, pwm_clock_prescale_t prescaler)
{
    uint16_t reg = base->SM[subModule].CTRL;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    /* Clear LDOK bit if it is set */
    if (0U != (base->MCTRL & PWM_MCTRL_LDOK(subModuleMsk)))
    {
        base->MCTRL |= PWM_MCTRL_CLDOK(subModuleMsk);
    }
    /* Set submodule prescaler. */
    reg &= MCUX_MASK_INVERT_16(PWM_CTRL_PRSC_MASK);
    reg |= PWM_CTRL_PRSC(prescaler);
    base->SM[subModule].CTRL = reg;
    /* Set Load mode to make Buffered registers take effect immediately when LDOK bit set */
    base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;
    /* Set LDOK bit to load buffer registers */
    base->MCTRL |= PWM_MCTRL_LDOK(subModuleMsk);
    /* Restore Load mode */
    base->SM[subModule].CTRL = reg;
}

/*!
 * brief This function enables-disables the forcing of the output of a given eFlexPwm channel to logic 0.
 *
 * param base               PWM peripheral base address
 * param pwmChannel         PWM channel to configure
 * param subModule          PWM submodule to configure
 * param forcetozero        True: Enable the pwm force output to zero; False: Disable the pwm output resumes normal
 *                          function.
 */
void PWM_SetPwmForceOutputToZero(PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmChannel, bool forcetozero)
{
#if !defined(PWM_MASK_UPDATE_MASK)
    uint16_t reg = base->SM[subModule].CTRL2;
#endif
    uint16_t mask;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    if (kPWM_PwmA == pwmChannel)
    {
        mask = PWM_MASK_MASKA(subModuleMsk);
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        mask = PWM_MASK_MASKB(subModuleMsk);
    }
    else
    {
        mask = PWM_MASK_MASKX(subModuleMsk);
    }

    if (forcetozero)
    {
        /* Disables the channel output, forcing output level to 0 */
        base->MASK |= mask;
    }
    else
    {
        /* Enables the channel output */
        base->MASK &= MCUX_MASK_INVERT_16(mask);
    }

#if defined(PWM_MASK_UPDATE_MASK)
    /* Update output mask bits immediately with UPDATE_MASK bit */
    base->MASK |= PWM_MASK_UPDATE_MASK(subModuleMsk);
#else
    /* Select local force signal */
    base->SM[subModule].CTRL2 &= MCUX_MASK_INVERT_16(PWM_CTRL2_FORCE_SEL_MASK);
    /* Issue a local Force trigger event */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
    /* Restore the source of FORCE OUTPUT signal */
    base->SM[subModule].CTRL2 = reg;
#endif
}

/*!
 * brief This function set the output state of the PWM pin as requested for the current cycle.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param pwmChannel         PWM channel to configure
 * param outputstate        Set pwm output state, see @ref pwm_output_state_t.
 */
void PWM_SetChannelOutput(PWM_Type *base,
                          pwm_submodule_t subModule,
                          pwm_channels_t pwmChannel,
                          pwm_output_state_t outputstate)
{
    uint16_t mask, swcout, sourceShift;
    uint16_t reg = base->SM[subModule].CTRL2;
    uint16_t swcoutShift, dtsrcselShift;
    uint16_t dtsrcselTemp = 0U;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;

    assert(subModuleMsk <= 0x8U);

    swcoutShift = (uint16_t)subModule * 2U;
    dtsrcselShift = (uint16_t)subModule * 4U;
    assert(swcoutShift <= 6U);
    assert(dtsrcselShift <= 12U);

    if (kPWM_PwmA == pwmChannel)
    {
        mask        = PWM_MASK_MASKA(subModuleMsk);
        swcout      = (uint16_t)(((uint32_t)PWM_SWCOUT_SM0OUT23_MASK << swcoutShift) & 0xFFFFU);
        sourceShift = (uint16_t)PWM_DTSRCSEL_SM0SEL23_SHIFT + dtsrcselShift;
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        mask        = PWM_MASK_MASKB(subModuleMsk);
        swcout      = (uint16_t)(((uint32_t)PWM_SWCOUT_SM0OUT45_MASK << swcoutShift) & 0xFFFFU);
        sourceShift = (uint16_t)PWM_DTSRCSEL_SM0SEL45_SHIFT + dtsrcselShift;
    }
    else
    {
        mask        = PWM_MASK_MASKX(subModuleMsk);
        swcout      = 0U;
        sourceShift = 0U;
    }

    assert(sourceShift <= 14U);

    if (kPWM_MaskState == outputstate)
    {
        /* Disables the channel output, forcing output level to 0 */
        base->MASK |= mask;
    }
    else
    {
        /* Enables the channel output first */
        base->MASK &= MCUX_MASK_INVERT_16(mask);

        dtsrcselTemp = base->DTSRCSEL;
        dtsrcselTemp &= MCUX_MASK_INVERT_16((uint16_t)(((uint32_t)3U << sourceShift) & 0xFFFFU));

        /* PwmX only support MASK mode */
        if (kPWM_PwmX != pwmChannel)
        {
            if (kPWM_HighState == outputstate)
            {
                base->SWCOUT |= swcout;
                dtsrcselTemp |= ((uint16_t)2U << sourceShift);
            }
            else if (kPWM_LowState == outputstate)
            {
                base->SWCOUT &= MCUX_MASK_INVERT_16(swcout);
                dtsrcselTemp |= ((uint16_t)2U << sourceShift);
            }
            else
            {
                dtsrcselTemp |= ((uint16_t)1U << sourceShift);
            }
        }
    }

    base->DTSRCSEL = dtsrcselTemp;

