RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_pwm.c
    /* Select local force signal */
    base->SM[subModule].CTRL2 &= MCUX_MASK_INVERT_16(PWM_CTRL2_FORCE_SEL_MASK);
    /* Issue a local Force trigger event */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
    /* Restore the source of FORCE OUTPUT signal */
    base->SM[subModule].CTRL2 = reg;
}

#if defined(FSL_FEATURE_PWM_HAS_PHASE_DELAY) && FSL_FEATURE_PWM_HAS_PHASE_DELAY
/*!
 * brief This function set the phase delay from the master sync signal of submodule 0.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param pwmChannel         PWM channel to configure
 * param delayCycles        Number of cycles delayed from submodule 0.
 *
 * return kStatus_Fail if the number of delay cycles is set larger than the period defined in submodule 0;
 *        kStatus_Success if set phase delay success
 */
status_t PWM_SetPhaseDelay(PWM_Type *base, pwm_channels_t pwmChannel, pwm_submodule_t subModule, uint16_t delayCycles)
{
    assert(subModule != kPWM_Module_0);
    uint16_t reg = base->SM[subModule].CTRL2;
    uint32_t subModuleMsk = 1UL << (uint32_t)subModule;
    assert(subModuleMsk <= 0x8U);

    /* Clear LDOK bit if it is set */
    if (0U != (base->MCTRL & PWM_MCTRL_LDOK(subModuleMsk)))
    {
        base->MCTRL |= PWM_MCTRL_CLDOK(subModuleMsk);
    }

    if (base->SM[kPWM_Module_0].VAL1 < delayCycles)
    {
        return kStatus_Fail;
    }
    else
    {
        /*
         * ERR051989: When the value of the phase delay register SMxPHASEDLY is reduced from a
         * non-zero value to 0 and submodule x reload source is from submodule0, the submodule
         * x may output an unexpected wide PWM pulse. The workaround is set SMxPHASEDLY=1,
         * SMxINIT=SM0INIT-1, SMxVALy=SM0VALy-1 (x=1,2,3, y=0,1,2,3,4,5).
         */
#if defined(FSL_FEATURE_PWM_HAS_ERRATA_51989) && FSL_FEATURE_PWM_HAS_ERRATA_51989
        if (delayCycles == 0U &&
            ((base->SM[subModule].CTRL2 & PWM_CTRL2_RELOAD_SEL_MASK) >> PWM_CTRL2_RELOAD_SEL_SHIFT) == 1U)
        {
            base->SM[subModule].PHASEDLY = 1U;
            base->SM[subModule].INIT     = (uint16_t)((base->SM[0].INIT - 1U) & 0xFFFFU);
            base->SM[subModule].VAL0     = (uint16_t)((base->SM[0].VAL0 - 1U) & 0xFFFFU);
            base->SM[subModule].VAL1     = (uint16_t)((base->SM[0].VAL1 - 1U) & 0xFFFFU);
            base->SM[subModule].VAL2     = (uint16_t)((base->SM[0].VAL2 - 1U) & 0xFFFFU);
            base->SM[subModule].VAL3     = (uint16_t)((base->SM[0].VAL3 - 1U) & 0xFFFFU);
            base->SM[subModule].VAL4     = (uint16_t)((base->SM[0].VAL4 - 1U) & 0xFFFFU);
            base->SM[subModule].VAL5     = (uint16_t)((base->SM[0].VAL5 - 1U) & 0xFFFFU);
        }
        else
        {
            base->SM[subModule].PHASEDLY = delayCycles;
        }
#else
        base->SM[subModule].PHASEDLY = delayCycles;
#endif
    }

    /* Select the master sync signal as the source for initialization */
    reg &= MCUX_MASK_INVERT_16(PWM_CTRL2_INIT_SEL_MASK);
    reg |= PWM_CTRL2_INIT_SEL(2);
    /* Set Load mode to make Buffered registers take effect immediately when LDOK bit set */
    base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;
    /* Set LDOK bit to load buffer registers */
    base->MCTRL |= PWM_MCTRL_LDOK(subModuleMsk);
    /* Restore the source of phase delay register intialization */
    base->SM[subModule].CTRL2 = reg;
    return kStatus_Success;
}
#endif /* FSL_FEATURE_PWM_HAS_PHASE_DELAY */
